[
  {
    "id": 0,
    "name": "Construcredi",
    "description": "O Construcredi é uma plataforma robusta de gestão empresarial.",
    "period": "2024",
    "images": "/projects/construcredi.png",
    "background": "/projects/bg_construcredi.png",
    "role": "FullStack",
    "team": "",
    "resume": "O Construcredi é uma plataforma robusta de gestão empresarial, projetada para oferecer controle total sobre vendas, cadastro de bancos, clientes, funcionários e geração de relatórios dinâmicos. Os relatórios podem ser facilmente filtrados por períodos, fornecendo aos usuários uma visão detalhada e acessível de suas operações diretamente na palma da mão.\n\nEste projeto foi desenvolvido do zero, com um processo estruturado que incluiu:\n\nLevantamento de Requisitos: Identificação detalhada das necessidades do cliente para assegurar que o produto final atendesse às expectativas de gestão e funcionalidade.\n\nPrototipação e Design UX/UI: Criação de protótipos interativos utilizando o Figma, focando na experiência do usuário (UX) e interfaces intuitivas (UI) para garantir facilidade de uso e eficiência.\n\nDesenvolvimento e Arquitetura: Modelagem completa do banco de dados e implementação tanto do front-end quanto do back-end, utilizando tecnologias modernas para garantir escalabilidade e performance.\n\nTecnologias Utilizadas: Figma, Next.js, Nest.js, MongoDB, Material UI\n\nCom esse projeto, entreguei uma solução completa, escalável e intuitiva, que oferece ao cliente uma gestão simplificada e eficaz de suas operações diárias.",
    "link_demo": "https://construcredi.net.br/",
    "link_github": ""
  },
  {
    "id": 1,
    "name": "Tagarelas",
    "description": "Plataforma de gerenciamento de clínicas projetada para otimizar o controle.",
    "period": "2024",
    "images": "/projects/tagarelas.png",
    "background": "/projects/bg_tagarelas.png",
    "role": "FullStack",
    "team": "Duotech",
    "resume": "O Tagarelas é uma plataforma de gerenciamento de clínicas projetada para otimizar o controle de pacientes, profissionais, finanças e pagamentos. Com funcionalidades avançadas, a plataforma permite que administradores e recepcionistas agendem consultas de maneira eficiente, integrando automaticamente o envio de notificações aos pacientes para confirmação ou cancelamento dos agendamentos.\n\nNeste projeto, fui responsável por:\nModelagem do Banco de Dados: Estruturação de um banco de dados escalável e eficiente, garantindo o armazenamento seguro e organizado das informações de pacientes, profissionais e transações financeiras.\n\nDesenvolvimento de Páginas Responsivas: Criação de interfaces intuitivas e responsivas, otimizadas para oferecer uma experiência fluida em diferentes dispositivos, desde computadores até smartphones.\n\nDesenvolvimento de um Projeto Escalável: Implementação de uma arquitetura que permite o crescimento contínuo da plataforma, assegurando que novas funcionalidades possam ser integradas com facilidade.\n\nTecnologias Utilizadas: Next.js, Nest.js, MongoDB, Material UI\n\nCom essa solução, entreguei uma plataforma completa e escalável que melhora significativamente a gestão das clínicas, aumentando a eficiência no atendimento e facilitando a comunicação com os pacientes.",
    "link_demo": "https://app.clinicatagarelas.com.br/",
    "link_github": ""
  },
  {
    "id": 2,
    "name": "Criativistas",
    "description": "Site com ferramentas e inteligência artificial para ajudar área de marketing.",
    "period": "2023",
    "images": "/projects/criativistas.png",
    "background": "/projects/bg_criativistas.png",
    "role": "FullStack",
    "team": "Duotech",
    "resume": "O Criativistas é uma plataforma inovadora que utiliza ferramentas, insights e inteligência artificial para ajudar os usuários a gerar ideias criativas e avaliar a qualidade de seus projetos com base em feedbacks automatizados. A plataforma oferece suporte em todas as etapas do processo criativo, desde a concepção até a validação de ideias.\n\nMinhas contribuições para o projeto incluem:\n\nIntegração de Pagamentos: Na primeira fase do projeto, fui responsável pela integração do PagBank, configurando planos de assinatura e implementando o sistema de pagamento recorrente para usuários.\n\nDesenvolvimento Fullstack: Na segunda fase, atuei como desenvolvedora Fullstack, implementando melhorias no site e desenvolvendo dois módulos principais:\nDesafio Criativista: Uma funcionalidade interativa que desafia os usuários a exercitarem sua criatividade.\nTermômetro de Ideias com Feedback da IA: Um módulo que utiliza inteligência artificial para avaliar e fornecer feedback sobre as ideias propostas pelos usuários, ajudando a melhorar e validar seus projetos.\n\nTecnologias Utilizadas: React, React Hooks, API Rest, Express, MongoDB, OpenAI\n\nEsse projeto exemplifica a aplicação prática de inteligência artificial para aprimorar processos criativos, oferecendo uma solução que vai além da simples geração de ideias, ajudando os usuários a desenvolverem projetos melhores com feedbacks inteligentes e em tempo real.",
    "link_demo": "https://criativistas.com.br/",
    "link_github": ""
  },
  {
    "id": 3,
    "name": "Davozzi",
    "description": "Sites sobre os caldos da Davozzi, com receitas e muito mais.",
    "period": "2023",
    "images": "/projects/davozzi.png",
    "background": "/projects/bg_davozzi.png",
    "role": "WordPress",
    "tag": "Site",
    "team": "Duotech",
    "resume": "Desenvolvi utilizando o WordPress como base para criação de um site robusto e dinâmico. A estrutura foi implementada com técnicas avançadas como Flexbox, garantindo layouts flexíveis e responsivos, além da aplicação de loops personalizados para exibição dinâmica de conteúdo.\n\nComo desenvolvedora principal, fui responsável por todo o processo de desenvolvimento, desde a implementação do layout até a funcionalidade, entregando uma plataforma altamente funcional e otimizada para diferentes dispositivos.\n\nTecnologias Utilizadas: WordPress, Flexbox, Loop Personalizado\n\nEste projeto demonstra minha capacidade de desenvolver soluções eficientes e modernas, utilizando o WordPress em conjunto com técnicas avançadas de design e desenvolvimento para criar uma experiência de usuário fluida e intuitiva.",
    "link_demo": "https://www.caldosdavozzi.com.br/",
    "link_github": ""
  },
  {
    "id": 4,
    "name": "E-boi",
    "description": "Plataforma de gerenciamento de fazenda.",
    "period": "2022 - 2024",
    "images": "/projects/eboi.png",
    "background": "/projects/bg_eboi.png",
    "role": "Fullstack",
    "team": "Duotech",
    "resume": "O E-Boi é uma plataforma de gerenciamento agrícola que oferece controle total sobre os animais, suprimentos, compras e vendas, além da gestão completa do rebanho. A plataforma inclui relatórios detalhados, acessíveis diretamente na palma da mão, otimizando a administração das fazendas.\n\nPara gerenciar o desenvolvimento do projeto, utilizamos o framework Scrum, realizando reuniões semanais para acompanhar o progresso e garantir a entrega eficiente de cada etapa.\n\nO desenvolvimento da plataforma foi dividido em duas fases:\n\nPrimeira Etapa: Atuei como desenvolvedora Front-end, utilizando Next.js para implementar a interface e integrando-a ao back-end por meio do Axios.\n\nSegunda Etapa: Assumi o papel de desenvolvedora principal e atuei como Fullstack. Continuei com o desenvolvimento do Front-end, mantendo as mesmas tecnologias, e passei a integrar APIs externas. No Back-end, utilizei Express, MySQL e implementei uma Rest API para gerenciar a lógica de negócios e o armazenamento de dados.\n\nTecnologias Utilizadas: Next.js, Axios, Express, MySQL, Rest API, Scrum\n\nEsse projeto demonstra minha capacidade de liderar o desenvolvimento Fullstack de uma plataforma robusta e escalável, utilizando as melhores práticas de gestão ágil e uma stack tecnológica moderna para otimizar processos na gestão de fazendas.",
    "link_demo": "https://e-boi.info/",
    "link_github": ""
  },
  {
    "id": 5,
    "name": "Fight Pro Bahia",
    "description": "Portal de gestão de lutas",
    "period": "2022",
    "images": "/projects/fight.png",
    "background": "/projects/bg_fight.png",
    "role": "Front-End",
    "team": "Fernanda - Desenvolvedora",
    "resume": "Neste projeto, fui responsável pelo desenvolvimento do Front-end das páginas de Home e Inscrição, utilizando PHP como principal linguagem. Durante o processo, adquiri experiência prática em desenvolvimento de páginas dinâmicas com PHP, aplicando as melhores práticas para garantir interfaces funcionais e responsivas.\n\nAlém de estruturar o layout e a navegação, também foquei na otimização da experiência do usuário, garantindo que as páginas fossem intuitivas e acessíveis em diferentes dispositivos.\n\nTecnologias Utilizadas: PHP\n\nEsse projeto reflete minha capacidade de aplicar PHP para desenvolver Front-end de alta qualidade, além de demonstrar minha habilidade em criar páginas funcionais e bem estruturadas.",
    "link_demo": "https://fightprobahia.com/",
    "link_github": ""
  },
  {
    "id": 6,
    "name": "Jupiter - Law",
    "description": "Plataforma de gerenciamento de advocacia. Administre seu escritório com mais facilidade.",
    "period": "2023 - 2024",
    "images": "/projects/law.png",
    "background": "/projects/bg_law.png",
    "role": "Fullstack",
    "team": "Christian - Frontend, Larissa Mendes UX/UI",
    "resume": "Neste projeto, utilizamos o framework Scrum para a gestão, com reuniões semanais para acompanhar o progresso de cada etapa. O uso da plataforma Trello complementou o acompanhamento, permitindo a visualização clara do andamento e status de cada fase.\n\nMinha principal atuação foi como desenvolvedora principal do Back-end, onde utilizei NestJs e MongoDB para construir a lógica de negócios e o armazenamento de dados, seguindo a arquitetura Rest API. Fui responsável por todo o processo de autenticação, implementando medidas de segurança e criptografia para proteger os módulos e dados da plataforma.\n\nAlém disso, integrei o PagBank, configurando planos de assinatura e implementando o sistema de pagamento recorrente dos clientes.\n\nEmbora meu foco fosse o Back-end, também contribuí no Front-end, ajustando as integrações e layouts conforme o feedback dos usuários. O Front-end foi desenvolvido com ReactJs e Material UI, e participei na otimização da interface e na correção de detalhes para melhorar a experiência do usuário.\n\nTecnologias Utilizadas: NestJs, MongoDB, ReactJs, Material UI, PagBank, Trello, Scrum\n\nEsse projeto destaca minha expertise em desenvolvimento Back-end com segurança, integração de sistemas de pagamento e colaboração no Front-end, resultando em uma plataforma robusta e eficiente.",
    "link_demo": "https://law.jupiterspace.com.br/",
    "link_github": ""
  },
  {
    "id": 7,
    "name": "KanBan",
    "description": "Plataforma de gerenciamento de tarefas.",
    "tag": "Site",
    "period": "2024 - Em desenvolvimento",
    "images": "/projects/kanban.png",
    "background": "/projects/bg_kanban.png",
    "role": "FullStack",
    "team": "",
    "resume": "O KanBan é um desafio proposto pela Front-end Mentor, com o objetivo de aprimorar minhas habilidades em CSS e desenvolvimento Front-end. Este projeto também está sendo aproveitado para pontuação em atividades acadêmicas.\n\nAtualmente, o projeto encontra-se em andamento, com o Front-end já implementado utilizando Next.js e Styled Components para criar uma interface moderna e responsiva, focada na organização e usabilidade.\n\nNa próxima etapa, planejo desenvolver o Back-end utilizando Express, MongoDB e a arquitetura Rest API para gerenciar a lógica e o armazenamento de dados, garantindo a funcionalidade completa do sistema KanBan.\n\nTecnologias Utilizadas (Front-end): Next.js, Styled Components\n\nPlanejamento do Back-end: Express, MongoDB, Rest API\n\nEsse projeto demonstra meu comprometimento com o aprendizado contínuo e a aplicação prática de novas tecnologias, tanto no Front-end quanto no Back-end, para desenvolver soluções completas e funcionais.",
    "link_demo": "https://kanban-larissacalmeida.vercel.app/",
    "link_github": "https://github.com/LarissaCalmeida/kanban"
  },
  {
    "id": 8,
    "name": "Where in the world",
    "description": "Where in the world",
    "period": "Nov 2021",
    "images": "/projects/where-in-the-world.jpg",
    "tag": "Site",
    "background": "/projects/where-in-the-world.jpg",
    "role": "Front-End",
    "team": "O Where in the World é um desafio do site Frontend Mentor",
    "resume": "O Where in the World é um desafio do site Frontend Mentor, onde apliquei e expandi meus conhecimentos em API Rest, com funcionalidades como filtragem por nome e regiões. Durante o desenvolvimento, também aprendi e utilizei Tailwind CSS para estilização, criando um layout moderno e responsivo.\n\nO site foi desenvolvido com suporte a dark mode, proporcionando uma experiência de usuário fluida e acessível em diferentes dispositivos.\n\nTecnologias Utilizadas: Next.js, Tailwind CSS, API Rest\n\nEste projeto destaca minha habilidade em integrar APIs, criar interfaces responsivas e implementar funcionalidades de design, como o dark mode, usando ferramentas modernas de desenvolvimento.",
    "link_demo": "https://countries-tailwind-next.vercel.app/",
    "link_github": "https://github.com/LarissaCalmeida/countries-tailwind-next"
  },
  {
    "id": 9,
    "name": "Libertas",
    "description": "Libertas é um site para vendas de produtos de EPI's",
    "tag": "Site",
    "period": "2023",
    "images": "/projects/libertas.png",
    "background": "/projects/bg_libertas.png",
    "role": "WordPress",
    "team": "Duotech",
    "resume": "Desenvolvi utilizando o WordPress como base para criação de um site robusto e dinâmico. A estrutura foi implementada com técnicas avançadas como Flexbox, garantindo layouts flexíveis e responsivos, além da aplicação de loops personalizados para exibição dinâmica de conteúdo.\n\nComo desenvolvedora principal, fui responsável por todo o processo de desenvolvimento, desde a implementação do layout até a funcionalidade, entregando uma plataforma altamente funcional e otimizada para diferentes dispositivos.\n\nTecnologias Utilizadas: WordPress, Elementor, Flexbox, Loop Personalizado\n\nEste projeto demonstra minha capacidade de desenvolver soluções eficientes e modernas, utilizando o WordPress em conjunto com técnicas avançadas de design e desenvolvimento para criar uma experiência de usuário fluida e intuitiva.",
    "link_demo": "https://libertasrs.com.br/",
    "link_github": ""
  },
  {
    "id": 10,
    "name": "Move It",
    "description": "Desafios utilizando técnicas de pomodoro. Melhorando o foco e produtividade.",
    "tag": "Site",
    "period": "2021",
    "images": "/projects/moveit.png",
    "background": "/projects/bg_moveit.png",
    "role": "Front-End",
    "team": "",
    "resume": "Este projeto foi promovido pela Rocketseat, onde tive a oportunidade de aprofundar meus conhecimentos em React e React Hooks. Durante essa experiência, explorei os conceitos fundamentais do desenvolvimento de aplicações web modernas, focando na criação de interfaces interativas e dinâmicas.\n\nA imersão no projeto não apenas consolidou minha compreensão sobre a biblioteca React, mas também me ensinou a aplicar Hooks para gerenciar estado e efeitos colaterais de forma eficiente, melhorando a performance e a legibilidade do código.\n\nTecnologias Utilizadas: React, React Hooks\n\nEsse projeto destaca meu compromisso com o aprendizado contínuo e minha capacidade de aplicar novas habilidades em desenvolvimento front-end.",
    "link_demo": "https://move-it-five-kappa.vercel.app/",
    "link_github": ""
  },

  {
    "id": 11,
    "name": "Portal de Egressos",
    "description": "Site de portal de egressos da UESC",
    "period": "2022",
    "images": "/projects/portal_egressos.png",
    "background": "/projects/bg_portal_egressos.png",
    "role": "Front-End",
    "team": "Ellison - Back-End, Trícia - Orientadora",
    "resume": "O Programa de Egressos é uma plataforma desenvolvida para monitorar a trajetória profissional dos ex-alunos e identificar possíveis lacunas no programa de formação oferecido pela instituição de ensino. Além disso, a plataforma tem como objetivo promover eventos e notificar a comunidade acadêmica sobre oportunidades de emprego e projetos de extensão disponíveis.\n\nPara gerenciar o desenvolvimento do projeto, utilizamos o framework Scrum, com sprints semanais para garantir o progresso contínuo e a entrega eficiente de funcionalidades. Neste projeto, atuei como desenvolvedora Front-end, sendo responsável pelo desenvolvimento completo da interface e pela implementação de animações, proporcionando uma experiência de usuário envolvente e intuitiva.\n\nAté o momento da finalização do meu contrato com o projeto de extensão, o Back-end ainda não havia sido implementado, resultando em uma pré-visualização do site sem integração na Vercel.\n\nTecnologia Utilizada: Next.js\n\nEsse projeto demonstra minha capacidade de trabalhar em um ambiente ágil, desenvolvendo soluções focadas na experiência do usuário e contribuindo para o aprimoramento da conexão entre a instituição e seus ex-alunos.",
    "link_demo": "https://front-programa-egressos.vercel.app/",
    "link_github": "https://github.com/LarissaCalmeida/Front-ProgramaEgressos"
  },
  {
    "id": 12,
    "name": "Raizen - Relatório Anual",
    "description": "Relatório Anual de 2022/2023",
    "period": "2023",
    "images": "/projects/raizen.png",
    "background": "/projects/bg_raizen.png",
    "role": "Front-End",
    "team": "",
    "resume": "Neste projeto, atuei como desenvolvedora Front-end, utilizando HTML, CSS e i18n para implementar a tradução das páginas. Minha principal responsabilidade foi criar uma interface acessível e intuitiva, garantindo que os usuários pudessem navegar facilmente em diferentes idiomas.\n\nUm dos principais desafios deste projeto foi garantir a responsividade de cada seção do site, assegurando que os elementos se ajustassem de maneira eficaz em diversos dispositivos e tamanhos de tela. Concentrei-me em preservar a estética e a funcionalidade, independentemente da plataforma utilizada.\n\nTecnologias Utilizadas: HTML, CSS, i18n\n\nEsse projeto destaca minha capacidade de desenvolver interfaces responsivas e multilíngues, bem como meu compromisso em oferecer uma experiência de usuário de alta qualidade.",
    "link_demo": "https://www.raizen.com.br/relatorioanual/2023/pt/",
    "link_github": "https://github.com/LarissaCalmeida/landing_page_raizen"
  },
  {
    "id": 13,
    "name": "Renderfy",
    "description": "Renderfy é uma plataforma de upload de projetos arquitetônicos para renderização",
    "period": "2021",
    "images": "/projects/renderfy.png",
    "background": "/projects/bg_renderfy.png",
    "role": "Front-End",
    "team": "",
    "resume": "Neste projeto, atuei como desenvolvedora Front-end, sendo responsável pelo desenvolvimento completo da interface e pela criação de animações envolventes.\n\nEmbora o Back-end não tenha sido implementado, entreguei uma pré-visualização do site sem integração na Vercel. Um dos principais desafios foi desenvolver animações fluidas e criar um formulário em etapas, garantindo que as informações fossem mantidas de forma eficaz durante todo o processo.\n\nTecnologia Utilizada: Next.js\n\nEsse projeto demonstra minha habilidade em construir interfaces dinâmicas e interativas, além de minha capacidade de enfrentar desafios de usabilidade e design no desenvolvimento Front-end.",
    "link_demo": "https://front-renderfy.vercel.app/",
    "link_github": "https://github.com/LarissaCalmeida/Front_Renderfy_Teste"
  },
  {
    "id": 14,
    "name": "samcorp",
    "description": "A samcorp é um site de soluções tecnológicas",
    "period": "2023",
    "images": "/projects/samcorp.png",
    "tag": "Site",
    "background": "/projects/bg_samcorp.png",
    "role": "Front-End",
    "team": "Duotech",
    "resume": "Neste projeto, realizei o desenvolvimento do Front-end sem o uso de frameworks, utilizando apenas HTML e CSS. O objetivo deste projeto era criar um tema personalizado para WordPress, desenvolvendo suas páginas de forma a atender às necessidades específicas do cliente.\n\nMinha abordagem incluiu a criação de um layout intuitivo e responsivo, garantindo que as páginas fossem visualmente atraentes e funcionais em diferentes dispositivos. Trabalhei em todos os aspectos do design, desde a estruturação do conteúdo até a estilização, para garantir uma experiência de usuário coesa.\n\nTecnologias Utilizadas: HTML, CSS, WordPress\n\nEsse projeto destaca minha capacidade de desenvolver temas personalizados para WordPress, demonstrando minhas habilidades em design e implementação de interfaces sem depender de frameworks.",
    "link_demo": "https://samcorp.com.br/",
    "link_github": ""
  },
  {
    "id": 15,
    "name": "Bom Jesus",
    "description": "Site sobre a Bom Jesus",
    "period": "2023",
    "images": "/projects/bomjesus.png",
    "tag": "Site",
    "background": "/projects/bg_bomjesus.png",
    "role": "WordPress",
    "team": "Duotech",
    "resume": "Desenvolvi utilizando o WordPress como base para criação de um site robusto e dinâmico. A estrutura foi implementada com técnicas avançadas como Flexbox, garantindo layouts flexíveis e responsivos, além da aplicação de loops personalizados para exibição dinâmica de conteúdo.\n\nComo desenvolvedora principal, fui responsável por todo o processo de desenvolvimento, desde a implementação do layout até a funcionalidade, entregando uma plataforma altamente funcional e otimizada para diferentes dispositivos.\n\nTecnologias Utilizadas: WordPress, Flexbox, Loop Personalizado\n\nEste projeto demonstra minha capacidade de desenvolver soluções eficientes e modernas, utilizando o WordPress em conjunto com técnicas avançadas de design e desenvolvimento para criar uma experiência de usuário fluida e intuitiva.",
    "link_demo": "",
    "link_github": ""
  },
  {
    "id": 16,
    "name": "Sunnyside",
    "description": "Landing Page da Sunnyside",
    "period": "2023",
    "images": "/projects/sunnyside.jpg",
    "tag": "Site",
    "background": "/projects/sunnyside.jpg",
    "role": "HTML, CSS, Grid, Flexbox",
    "team": "",
    "resume": "Desafio do Front-end Mentor, Sunnyside é uma landing page que apliquei e melhorei os conhecimentos em relação ao Grid e Flexbox, para explorar o conhecimento nessa área e criar sites mais fluidos e responsivos.",
    "link_demo": "https://sunnyside-lp-mu.vercel.app/",
    "link_github": "https://github.com/LarissaCalmeida/sunnyside-lp"
  },
  {
    "id": 17,
    "name": "Fylo",
    "description": "Landing Page da Fylo",
    "period": "2023",
    "images": "/projects/fylo.jpg",
    "tag": "Site",
    "background": "/projects/fylo.jpg",
    "role": "HTML, CSS, Grid, Flexbox",
    "team": "",
    "resume": "Desafio do Front-end Mentor, Fylo é uma landing page que apliquei e melhorei os conhecimentos em relação ao Grid e Flexbox, para explorar o conhecimento nessa área e criar sites mais fluidos e responsivos.",
    "link_demo": "https://fylo-lp-six.vercel.app/",
    "link_github": "https://github.com/LarissaCalmeida/fylo-lp"
  }
]
